# JavaScript. Ядро: 2-ое издание
_Dmitry Soshnikov  in ECMAScript	| 2017-12-05_
[Original](http://dmitrysoshnikov.com/ecmascript/javascript-the-core-2nd-edition-rus/)

Данная статья описывает рантайм-систему ES2017+.

**Обратите внимание:** последнюю версию [ECMAScript](https://tc39.github.io/ecma262/) спецификации можно найти на сайте комитета TC-39.

Мы начинаем нашу дискуссию с рассмотрения концепции объекта, являющейся фундаментальной абстракцией в ECMAScript.

## Объект
ECMAScript — это объектно-ориентированный язык программирования с прототипной организацией, имеющий концепцию объекта в качестве базовой абстракции.

**Определение 1: Объект:** _Объект — это коллекция свойств_, имеющая также связанный с ней _объект-прототип_. Прототипом может быть также другой объект, или же значение null.

Рассмотрим простейшую схему объекта, с которой будем работать в последующих описаниях. На свой прототип объект ссылается посредством внутреннего свойства [[Prototype]], которое доступно в пользовательском коде через свойство __proto__.

Для кода:
```javascript
let point = {
  x: 10,
  y: 20,
};
```
мы имеем следующую структуру с двумя явными собственными свойствами и одним неявным (внутренним) свойством __proto__, которое является ссылкой на прототип объекта _point_:

![alt text](http://dmitrysoshnikov.com/wp-content/uploads/2017/11/js-object.png "Схема 1. Простейший объект с прототипом.")
_Схема 1. Простейший объект с прототипом._
